# Импортируем библиотеку colorama
from colorama import init, Fore, Style

# Инициализация для работы в Windows
init(autoreset=True)


def print_task():
    task_text = (
        "5. У ящику лежать 76 фруктів, маса кожного з яких виражається натуральним числом. \n"
        "У ящику є принаймні два фрукти різної маси, а середня маса всіх фруктів становить 100 грамів. \n"
        "Середня маса фруктів, маса кожного із яких є меншою за 100 грамів, становить 85. \n"
        "Середня маса фруктів, маса кожного із яких є більшою за 100 грамів, становить 124.\n"
        "a) Чи могло у ящику виявитися порівну фруктів масою меншою за 100 грамів \nта фруктів масою більшою за 100 грамів? "
        "(3 бали);\n"
        "б) Чи могло у ящику опинитися менше 8 фруктів, маса кожного з яких дорівнює 100 грамів? "
        "(4 бали).\n"
    )

    print(task_text)
    print(
        Fore.GREEN + "Розширюємо задачу б): \nперевіряємо можливість наявності фруктів масою 100 грамів для будь-якого натурального числа від 0 до 74, \nа не тільки для 8.\n")


def solve_d(max_x):
    results = []
    # Перебираємо x від 0 до max_x (число фруктів по 100 грамів)
    for x in range(0, max_x + 1):
        if (1824 - 24 * x) % 39 == 0:
            N2 = (1824 - 24 * x) // 39  # Кількість фруктів по 85 грамів
            N3 = 76 - (N2 + x)  # Кількість фруктів по 124 грамів

            # Перевірка, що N2 і N3 - неотрицательние числа
            if N2 >= 0 and N3 >= 0:
                results.append((x, N2, N3))

    # Формуємо відповідь
    if results:
        print("\nПАРИ є:\n")
        for x, N2, N3 in results:
            print(
                f"{Fore.GREEN}X = {x} (фруктів по 100 грамів){Style.RESET_ALL}, N2 = {N2} (фруктів по 85 грамів), N3 = {N3} (фруктів по 124 грамів)")

        final_x = results[0][0]
        final_N2 = results[0][1]
        final_N3 = results[0][2]

        print("\nРозпишемо першу знайдену пару детальніше:")
        print(f"{Fore.GREEN}X - {final_x} фруктів по 100 грамів.{Style.RESET_ALL}")
        print(f"N2 - {final_N2} фруктів по 85 грамів.")
        print(f"N3 - {final_N3} фруктів по 124 грамів.\n")

    else:
        print("\nПар немає.\n")

    input("Натисніть Enter, щоб закрити програму...")


# Запуск програми і вивід результату
if __name__ == "__main__":
    print_task()  # Виводимо текст задачі
    max_x = int(input("Введіть максимальне значення x (вiд 0 до 74): "))
    solve_d(max_x)  # Виводимо відповідь
